Catalogs/ТЦВП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТЦВП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКомпьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСессии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦСостояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжатьРаботуМеждуИтерациями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТЦВП/Forms/ВиртуальныйПользователь/Ext/Form/Module.bsl
&НаСервере
// Установить наименование виртуального пользователя
//
Процедура УстановитьНаименование()
	
	// Определить пользователя
	ЕстьПользователь = ЗначениеЗаполнено(Объект.Пользователь);
	Есть = " от имени " + Объект.Пользователь;
	Нет = " с авторизацией ОС";
	Пользователь = ?(ЕстьПользователь, Есть, Нет);
	
	// Изменить наименование
	ТекущийОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ТЦГруппаВП"));
	Имя = Строка(Объект.Роль) + " на " + Объект.Компьютер + Пользователь;
	ТекущийОбъект.Наименование = Имя;
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
КонецПроцедуры // УстановитьНаименование()

&НаКлиенте
// Обработчик изменения виртуального пользователя
//
Процедура ПриИзменении(Элемент)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		УстановитьНаименование();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры // ПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		ТолькоПросмотр = Не ЭтоНовый();
		Элементы.Роль.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Пользователь.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Клиент.ТолькоПросмотр = ТолькоПросмотр;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// 
//
// Параметры:
//  
//
// Возвращаемое значение:
//  
//
Функция ЭтоНовый()
	
	Возврат РеквизитФормыВЗначение("Объект").ЭтоНовый();
	
КонецФункции // ЭтоНовый()
